Revit 2027 API
IntersectionResult.XYZPoint Property
Point of intersection in local 3d coordinates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ XYZPoint { get; }
Public ReadOnly Property XYZPoint As XYZ
	Get
public:
property XYZ^ XYZPoint {
	XYZ^ get ();
}
member XYZPoint : XYZ with get
Property Value
XYZ
Exceptions
Exception | Condition
InvalidOperationException |  Thrown in the getter when this property has not been set by the method providing the result.
See Also
Reference
IntersectionResult Class
Autodesk.Revit.DB Namespace